//
//  SomeLiMePTTypeDesc.swift
//  Somlimee
//
//  Created by Chanhee on 2023/08/07.
//

import Foundation

struct SomeLiMePTTypeDesc {
    static let typeDetail = [
        "SDD": "활력성 우세 결핍형",
        "SDR": "활력성 우세 표준형",
        "SDE": "활력성 우세 과잉형",
        "CDD": "결집성 우세 결핍형",
        "CDR": "결집성 우세 표준형",
        "CDE": "결집성 우세 과잉형",
        "RDD": "수용성 우세 결핍형",
        "RDR": "수용성 우세 표준형",
        "RDE": "수용성 우세 과잉형",
        "HDD": "조화성 우세 결핍형",
        "HDR": "조화성 우세 표준형",
        "HDE": "조화성 우세 과잉형",
        "NDD": "무결정 결핍형",
        "NDR": "무결정 표준형",
        "NDE": "무결정 과잉형",
    ]
    static let typeDesc = [
        "SDD": "활력성 우세 결핍형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "SDR": "활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "SDE": "활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "CDD": "활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "CDR": "활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "CDE": "활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "RDD": "활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "RDR": "수용성 우세 표준형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "RDE": "수용성 우세 과잉형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "HDD": "조화성 우세 결핍형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "HDR": "조화성 우세 표준형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "HDE": "조화성 우세 과잉형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "NDD": "무결정 결핍형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "NDR": "무결정 표준형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
        "NDE": "무결정 과잉형활력성 우세 표준형은 다른 세가지 특성보다 활력성이 우월한 유형입니다. 이 유형은 다음과 같은 특징을 가집니다. 1. 의지력이 매우 강하며 성취하고 싶은 욕구가 많은 편입니다. 2. 성실한 편이지만 때때로 의기소침해 질 우려가 있습니다.",
    ]
}
